### SQLite3 and SQL operations ####

https://docs.python.org/3/library/sqlite3.html

SQLite is a C library that provides a lightweight disk-based database that doesn’t require a separate server process and allows accessing the database using a nonstandard variant of the SQL query language. Some applications can use SQLite for internal data storage. It’s also possible to prototype an application using SQLite and then port the code to a larger database such as PostgreSQL or Oracle.

In [70]:
# Import the modules

import sqlite3 as sql
import numpy as np
import pandas as pd

#### Basic operation to connect or create a databse ####

1. import sqlite3 gives our Python program access to the sqlite3 module.
2. The sqlite3.connect() function returns a Connection object that we will use to interact with the SQLite database held in the file test.db. 
3. The test.db file is created automatically by sqlite3.connect() if test.db does not already exist on our computer.

We can verify we successfully created our connection object by running:

In [71]:
# Create a Database

conn = sql.connect('test1.db')

In [72]:
# Once a Connection has been established, create a Cursor object and call its execute() method to perform SQL commands

cur = conn.cursor()

In [73]:
# Create a table in test.db

cur.execute('''CREATE TABLE IF NOT EXISTS stocks
               (date text, trans text, symbol text, qty real, price real)''')

# Insert a row of data
cur.execute("INSERT INTO stocks VALUES ('2006-01-05','BUY','RHAT',100,35.14)")


# Save (commit) the changes
conn.commit()
cur.close()

# We can also close the connection if we are done with it.
# Just be sure any changes have been committed or they will be lost.
conn.close()

In [74]:
# Connect with test.db again since we closed it
# Read all the data that is in the table stocks

conn = sql.connect('test1.db')
cur =  conn.cursor()
for row in cur.execute('SELECT * FROM stocks ORDER BY price'):
        print(row)
cur.close()
conn.close()

('2006-01-05', 'BUY', 'RHAT', 100.0, 35.14)
('2006-01-05', 'BUY', 'RHAT', 100.0, 35.14)
('2006-01-05', 'BUY', 'RHAT', 100.0, 35.14)
('2006-02-01', 'Sell', 'GOOG', 1000.0, 700.0)
('2006-02-01', 'Sell', 'GOOG', 1000.0, 700.0)
('2006-02-01', 'Sell', 'GOOG', 1000.0, 700.0)
('2006-02-01', 'Sell', 'GOOG', 1000.0, 700.0)

In [75]:
con = sql.connect('Soccer_EPL.db')
curs = con.cursor()

In [76]:
sql_query = "SELECT name FROM sqlite_master  WHERE type='table'"

In [77]:
curs.execute(sql_query)
print(curs.fetchall())

[('TopScorers',), ('TopAssists',)]

In [78]:
# for row in cur.execute('SELECT * FROM TopScorers ORDER BY Name'):
#         print(row)
print(curs.execute('SELECT * FROM TopScorers ORDER BY Name').fetchone())

(None, 'Allan Saint-Maximin', 'Newcastle United', 23, 5)

In [79]:
# You can read a table into a pandas dataframe

df = pd.read_sql_query("SELECT * FROM Topscorers",con)

In [80]:
df.head()

    RK             Name               Team   P   G
0  1.0    Mohamed Salah          Liverpool  23  17
1  2.0       Diogo Jota          Liverpool  23  12
2  3.0  Raheem Sterling    Manchester City  22  10
3  4.0  Bruno Fernandes  Manchester United  25   9
4  NaN       Sadio Mané          Liverpool  22   9

In [81]:
# Writing to the test database
# Using sql commands - Method1
# Give some values to the variables

date = '2006-02-01'
trans = 'Sell'
symbol = 'GOOG'
qty = 1000
price = 700

with sql.connect("test1.db") as con1:
    c = con1.cursor()
    sql = ("INSERT INTO stocks (date, trans, symbol, qty , price)" "VALUES (?, ?, ?, ?, ?)")
    val = (date, trans, symbol, qty , price)
    c.execute(sql, val)
    con1.commit()
    for row in c.execute('SELECT * FROM stocks ORDER BY price'):
            print(row)
    c.close
    con1.close

('2006-01-05', 'BUY', 'RHAT', 100.0, 35.14)
('2006-01-05', 'BUY', 'RHAT', 100.0, 35.14)
('2006-01-05', 'BUY', 'RHAT', 100.0, 35.14)
('2006-02-01', 'Sell', 'GOOG', 1000.0, 700.0)
('2006-02-01', 'Sell', 'GOOG', 1000.0, 700.0)
('2006-02-01', 'Sell', 'GOOG', 1000.0, 700.0)
('2006-02-01', 'Sell', 'GOOG', 1000.0, 700.0)
('2006-02-01', 'Sell', 'GOOG', 1000.0, 700.0)

In [82]:
# Using pandas commands - Method 2

import sqlite3 as sql

datadb = pd.DataFrame([[date, trans, symbol, qty , price]],columns=['date', 'trans', 'symbol', 'qty' , 'price'])

connn = sql.connect("test1.db")    
c = connn.cursor()
datadb.to_sql('stocks',connn,if_exists='append',index=False)
connn.commit()
for row in c.execute('SELECT * FROM stocks ORDER BY price'):
    print(row)
c.close()
connn.close()

('2006-01-05', 'BUY', 'RHAT', 100.0, 35.14)
('2006-01-05', 'BUY', 'RHAT', 100.0, 35.14)
('2006-01-05', 'BUY', 'RHAT', 100.0, 35.14)
('2006-02-01', 'Sell', 'GOOG', 1000.0, 700.0)
('2006-02-01', 'Sell', 'GOOG', 1000.0, 700.0)
('2006-02-01', 'Sell', 'GOOG', 1000.0, 700.0)
('2006-02-01', 'Sell', 'GOOG', 1000.0, 700.0)
('2006-02-01', 'Sell', 'GOOG', 1000.0, 700.0)
('2006-02-01', 'Sell', 'GOOG', 1000.0, 700.0)